In [34]:
# This is my first to Machine learning 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns


# Intro Group by
# Splitting the data into groups based on some criteria
# Applying a function to echa group independently
# combining the results into a data structure

# On a dataframe we obtain groupy object by calling groupby() function.


df = pd.DataFrame({
    "A" : ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
    "B" : ["One", "One", "two", "three", "two", "two", "one", "three"],
    "C" : np.random.random(8),
    "D" : np.random.random(8)
})
# Grouping by a column label, selecting column labels and then applying the dataFrameGroupby.sum() function to see the resulting groups
df.groupby("A")[["C", "D"]].sum()

# Grouping by multiple columns labels forms multiindex
df.groupby(["A", "B"]).sum()


grouped = df.groupby("A") # or  df.groupby(df['A])
grouped = df.groupby("B")
grouped = df.groupby(['A', 'B'])


# A data set called drinks by country
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()
# drinks.info()

# print( "The mean of beer serving",  drinks.beer_servings.mean())

# variations in all continent
drinks.groupby('continent').beer_servings.mean()
drinks[drinks.continent == 'Africa'].beer_servings.mean()
drinks.groupby('continent').beer_servings.agg(['mean', 'max', 'min', 'count'])

# drinks.groupby('continent').mean() you need to select columns with numerical values only and group them together

# selecting columns with numeric data
numeric_cols = drinks.select_dtypes(include='number').columns 

drinks.groupby('continent')[numeric_cols].mean()


drinks[drinks.continent == 'Europe'].beer_servings.mean()


# agg() allows us to categorise more functions at once
drinks.groupby('continent').beer_servings.agg(["count", "max", 'min', 'mean'])

               count  max  min        mean
continent
Africa            53  376    0   61.471698
Asia              44  247    0   37.045455
Europe            45  361    0  193.777778
North America     23  285    1  145.434783
Oceania           16  306    0   89.687500
South America     12  333   93  175.083333

In [11]:
# splitting an object into groups
speeds = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
        
    ],
    index = ['falcom', 'parrot', 'lion', 'monkey', 'leopard'],
    columns=("class", "order", "max_speed")
)
speeds.head()
speeds.groupby()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, falcom to leopard
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   class      5 non-null      object
 1   order      5 non-null      object
 2   max_speed  4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 160.0+ bytes

In [70]:
#  how to calculate summary statistics
titanic = pd.read_csv("Datasets/titanic.csv")

titanic.head()

# Aggregating statistics - mean, min, max, count
titanic['Age'].mean()

# statistics are applied to columns with numerical data
# Operations in general exclude missing data and operate across rows by default

# what is the median age and fare
titanic[["Age", "Fare"]].median() # the selection of a two columns returns a dataframe

titanic[['Age', 'Fare']].describe()

# specific combinations of aggregating statistics for given columns can be defined using the DataFrame.agg() method:
titanic.agg(
    {
        'Age' : ['min', 'max', 'median', 'skew'],
        'Fare': ['min', 'max', 'median', 'mean']
    }
)

# What is the average age for male vs female
titanic[["Sex", 'Age']].groupby("Sex").mean() # a subselection is made for sex and age. and then groupby is applied on sex

# if we dont explicitly select columns the mean method is applied to each column containing numerical columns by passing numeric_only = True
titanic.groupby("Sex").mean(numeric_only=True)

''' 
If we are only interested in the average age for each gender the selection of columns (rectangular brackets[] as usual) 
is suported on the grouped data.
'''
titanic.groupby('Sex')["Age"].mean()

# What is the mean ticket fare price for each of the sex and cabin class combinations?
titanic.groupby(['Sex', "Pclass"])["Fare"].mean()

# grouping can be done by multiple columns at the same time. Provide the column names as a list to the groupby() method.

# counting the number of records by category
# what is the number of passengers in each of the cabin classes?
titanic['Pclass'].value_counts() # value counts method counts the number of records for each category

# using groupby() function
titanic.groupby('Pclass')['Pclass'].count()

# Both size and count can be used in combination with groupby. Size includes NaN values and provides the size of the table, count excludes the missing values. 


# How to manipulate textual data
titanic.head()
# make all name charaters lowercase
titanic['Name'].str.lower() # str is the accessor

# create a new column Surname that contains the surname of the passengers by extracting the part before the comma
titanic['Name'].str.split(',') # Each value is retrned s a list of two elements, the part before the comma and the aprt after the comma

titanic['Surname'] = titanic['Name'].str.split(',').str.get(0) # we use te str accessor and apply Series.str.get() to extract the relevant part

titanic['Surname'] 


# extract the passenger data about the countess on board of the Titanic
titanic['Name'].str.contains('countess')

titanic[titanic['Name'].str.contains('countess')]

titanic.head(20)
titanic.dropna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,McCarthy
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,Sandstrom
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,Bonnell
...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,Beckwith
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,Carlsson
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,Potter
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Graham
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr

In [77]:
titanic.dropna(subset=['Cabin'], inplace=True)
titanic.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,McCarthy
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,Sandstrom
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,Bonnell
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S,Beesley
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S,Sloper
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,Fortune
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C,Spencer
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C,Harper
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C,Ostby
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S,Woolner
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN,Icard
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S,Harris
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.0,0,0,C.A. 29395,10.5000,F33,S,Nye
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S,Moen
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,Fortune
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S,Chaffee
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,Goldschmidt
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C,Greenfield

In [78]:
titanic.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,McCarthy
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,Sandstrom
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,Bonnell
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S,Beesley
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S,Sloper
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S,Fortune
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C,Spencer
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C,Harper
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C,Ostby
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S,Woolner
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0000,B28,NaN,Icard
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S,Harris
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.0,0,0,C.A. 29395,10.5000,F33,S,Nye
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S,Moen
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S,Fortune
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S,Chaffee
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,Goldschmidt
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C,Greenfield

In [86]:
# Working with missing values

# pandas uses different sentinel values to represent a missing value depending on the datatype

M = pd.Series([1, 2], dtype=np.int64).reindex([0, 1, 2])
M
df = pd.Series([True, False], dtype=np.bool_).reindex([0, 1, 2])
df
# Detecting these missing values use the isna() or notna() methods
M.notna() # or isna() will also consider None a missing value

None == None
np.nan == np.nan

False

In [31]:
# Categorical Data
''' 
categoricals are pandas data types corresponding t categorical variables in statistics. categorical variables takes a limited and usually fixed number of possible values

categorical data might have an order

'''
# Object creation
s = pd.Series(['a', 'b', 'c', 'a'], dtype='category')
s

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): ['a', 'b', 'c']

In [68]:
# descriptive statisctics
df1 = pd.DataFrame(
    {"A": [1.0, np.nan, 3.0, 5.0, np.nan], "B": [np.nan, 2.0, 3.0, np.nan, 6.0]}
)


df2 = pd.DataFrame(
    {
        "A": [5.0, 2.0, 4.0, np.nan, 3.0, 7.0],
        "B": [np.nan, np.nan, 3.0, 4.0, 6.0, 8.0],
    }
)

df1
df2
df1["A"].sum(0, skipna=False)

# Missing data - by default is not included in the computations
# df1.dropna(how='any') # dropna drops any values with missing data
df1.fillna(value=5)

df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [79]:
df1.dropna(inplace=True)
df1

     A    B
2  3.0  3.0